1. Задайте имя устройства в соответствии с топологией
```
BR3(config)# hostname BR3
```
2. Назначьте доменное имя wsr2017.ru
```
BR3(config)# ip domain-name wsr2017.ru
```
3. Создайте пользователя wsr2017 с паролем cisco
  - Пароль пользователя должен храниться в конфигурации в виде результата хэш-функции.
  - Пользователь должен обладать максимальным уровнем привилегий.
```
BR3(config)# username wsr2017 privilege 15 secret cisco
```
4. Реализуйте модель AAA.
  - Аутентификация на удаленной консоли должна производиться с использованием локальной базы данных
  - После успешной аутентификации при входе с удаленной консоли пользователь сразу должен попадать в режим с максимальным уровнем привилегий.
  - Настройте необходимость аутентификации на локальной консоли.
  - При успешной аутентификации на локальной консоли пользователь должен попадать в режим с максимальным уровнем привилегий
```
BR3(config)# aaa new model
BR3(config)# aaa authentication login CONSOLE local
BR3(config)# aaa authentication login SSH local
BR3(config)# line console 0
BR3(config-line)# login authentication CONSOLE
BR3(config-line)# privilege 15
BR3(config)# line vty 0 15
BR3(config-line)# login authentication SSH
BR3(config-line)# privilege 15
```
5. Установите пароль wsr на вход в привилегированный режим. 
  - Пароль должен храниться в конфигурации НЕ в виде результата хэш-функции.
  - Настройте режим, при котором все пароли в конфигурации хранятся в зашифрованном виде.
```
BR3(config)# enable password wsr
BR3(config)# service password-encryption
```
6. Cоздайте виртуальные интерфейсы, подынтерфейсы и интерфейсы типа петля. Назначьте IP-адреса в соответствии с Таблицами 1 и 2.
```
BR3(config)# interface gigabitethernet 0/0
BR3(config-if)# no id address
BR3(config-if)# no shutdown
BR3(config)# interface loopback 101
BR3(config-if)# id address 192.168.33.254 255.255.255.0
BR3(config-if)# no shutdown
BR3(config)# interface loopback 102
BR3(config-if)# id address 192.168.34.254 255.255.255.0
BR3(config-if)# no shutdown
BR3(config)# interface loopback 103
BR3(config-if)# id address 3.3.3.3 255.255.255.255
BR3(config-if)# ipv6 enable
BR3(config-if)# ipv6 address dead:beef::3/128
BR3(config-if)# no shutdown
```
7. Устройство должно быть доступно для управления по протоколу SSH версии 2.
```
BR3(config)# crypto key generate rsa
BR3(config)# ip ssh version 2
BR3(config)# line vty 0 15
BR3(config-line)# transport input ssh
```