1. Создайте ВЛВС: 
  - под номером 101 с именем LAN.
  - под номером 102 с именем VOICE.
  - под номером 103 с именем EDGE.
```
SW2(config)# vlan 101
SW2(config-vlan)# name LAN
SW2(config)# vlan 102
SW2(config-vlan)# name VOICE
SW2(config)# vlan 103
SW2(config-vlan)# name EDGE
```

2. Выполните настройку протокола динамического согласования транков (DTP). 
  - Переведите порты Fa0/4-6 в режим, при котором каждый коммутатор ожидает начала согласования параметров от соседа, но сам не инициирует согласование.
  - Переведите порты Fa0/1-3 в режим передачи трафика по протоколу IEEE 802.1q. Явно отключите динамическое согласование транков.
```
SW2(config)# interface range fastethernet 0/4-6
SW2(config-if)# switchport mode dynamic auto
SW2(config)# interface range fastethernet 0/1-3
SW2(config-if)# switchport mode trunk
SW2(config-if)# switchport nonegotiate
```
3. Настройте агрегирование каналов связи между коммутаторами.
  - Номера портовых групп: 
    - 1 — с коммутатором SW1;
    - 2 — с коммутатором SW3;
  - Коммутатор должен быть настроен в пассивном режиме LACP с коммутатором SW3.
  - Коммутатор должен быть настроен в режиме активного согласования по протоколу PAgP с коммутатором SW1.
```
SW2(config)# interface range fastethernet 0/1-2
SW2(config-if-range)# channel group 1 mode desirable
SW2(config)# interface range fastethernet 0/4-5
SW2(config-if-range)# channel group 2 mode passive
```
4. Конфигурация протокола остовного дерева:
  - На всех коммутаторах используйте вариант протокола STP, совместимый со стандартом 802.1w.
  - Коммутатор должен являться первым резервным корнем связующего дерева в VLAN 101.
  - Коммутатор должен являться корнем связующего дерева в VLAN 102.
  - Коммутатор должен являться вторым резервным корнем связующего дерева в VLAN 103.
  - Используйте для передачи данных порты, не состоящие в портовых группах. В случае неисправности этих портов передача данных должна происходить через соответствующие агрегированные каналы.
```
SW2(config)# spanning-tree mode rapid-pvst
SW2(config)# spanning-tree vlan 101 priority 8192
SW2(config)# spanning-tree vlan 102 priority 4096
SW2(config)# spanning-tree vlan 103 priority 12288
SW2(config)# interface fastethernet 0/3, 0/6
SW2(config-if)# spanning-tree vlan 101 cost 8
SW2(config-if)# spanning-tree vlan 102 cost 8
SW2(config-if)# spanning-tree vlan 103 cost 8
```