1. Создайте ВЛВС: 
  - под номером 101 с именем LAN.
  - под номером 102 с именем VOICE.
  - под номером 103 с именем EDGE.
```
SW3(config)# vlan 101
SW3(config-vlan)# name LAN
SW3(config)# vlan 102
SW3(config-vlan)# name VOICE
SW3(config)# vlan 103
SW3(config-vlan)# name EDGE
```

2. Выполните настройку протокола динамического согласования транков (DTP). 
  - Переведите порты в Fa0/4-9 в режим, при котором коммутатор на данных портах будет инициировать согласование параметров транка.
```
SW3(config)# interface range fastethernet 0/4-9
SW3(config-if)# switchport mode dynamic desirable 
```
3. Настройте агрегирование каналов связи между коммутаторами.
  - Номера портовых групп: 
    - 2 — с коммутатором SW2;
    - 3 — с коммутатором SW1.
  - Коммутатор SW3 должен быть настроен в режиме активного согласования по обеим портовым группам по протоколу LACP;
```
SW3(config)# interface range fastethernet 0/4-5
SW3(config-if-range)# channel group 2 mode active
SW3(config)# interface range fastethernet 0/7-8
SW3(config-if-range)# channel group 3 mode active
```
4. Конфигурация протокола остовного дерева:
  - На всех коммутаторах используйте вариант протокола STP, совместимый со стандартом 802.1w.
  - Коммутатор должен являться вторым резервным корнем связующего дерева в VLAN 101.
  - Коммутатор должен являться первым резервным корнем связующего дерева в VLAN 102.
  - Коммутатор должен являться корнем связующего дерева в VLAN 103.
  - Используйте для передачи данных порты, не состоящие в портовых группах. В случае неисправности этих портов передача данных должна происходить через соответствующие агрегированные каналы.
```
SW3(config)# spanning-tree mode rapid-pvst
SW3(config)# spanning-tree vlan 101 priority 12288
SW3(config)# spanning-tree vlan 102 priority 8192
SW3(config)# spanning-tree vlan 103 priority 4096
```
7. Трафик сети LAN к HQ1 должен передаваться без тэга IEEE 802.1Q
```
SW3(config)# interface fastethernet 0/21
SW3(config)# switchport mode access
SW3(config)# switchport access vlan 101
```