1. Задайте имя устройства в соответствии с топологией
```
HQ1(config)# hostname HQ1
```
2. Назначьте доменное имя wsr2017.ru
```
HQ1(config)# ip domain-name wsr2017.ru
```
3. Создайте пользователя wsr2017 с паролем cisco
  - Пароль пользователя должен храниться в конфигурации в виде результата хэш-функции.
  - Пользователь должен обладать максимальным уровнем привилегий.
```
HQ1(config)# username wsr2017 privilege 15 secret cisco
```
4. Реализуйте модель AAA.
  - Аутентификация на удаленной консоли должна производиться с использованием локальной базы данных
  - После успешной аутентификации при входе с удаленной консоли пользователь сразу должен попадать в режим с максимальным уровнем привилегий.
  - Настройте необходимость аутентификации на локальной консоли.
  - При успешной аутентификации на локальной консоли пользователь должен попадать в режим с минимальным уровнем привилегий.
```
HQ1(config)# aaa new model
HQ1(config)# aaa authentication login CONSOLE local
HQ1(config)# aaa authentication login SSH local
HQ1(config)# line console 0
HQ1(config-line)# login authentication CONSOLE
HQ1(config-line)# privilege 1
HQ1(config)# line vty 0 15
HQ1(config-line)# login authentication SSH
HQ1(config-line)# privilege 15
```
5. Установите пароль wsr на вход в привилегированный режим. 
  - Пароль должен храниться в конфигурации НЕ в виде результата хэш-функции.
  - Настройте режим, при котором все пароли в конфигурации хранятся в зашифрованном виде.
```
HQ1(config)# enable password wsr
HQ1(config)# service password-encryption
```
6. Cоздайте виртуальные интерфейсы, подынтерфейсы и интерфейсы типа петля. Назначьте IP-адреса в соответствии с Таблицами 1 и 2.
  - Включите механизм SLAAC для выдачи IPv6-адресов в сети LAN на интерфейсе маршрутизатора HQ1.
```
HQ1(config)# interface gigabitethernet 0/0
HQ1(config-if)# id address 172.16.138.254 255.255.255.0
HQ1(config-if)# ipv6 enable
HQ1(config-if)# ipv6 2018:218A:4021::1/64
HQ1(config-if)# no shutdown
HQ1(config)# interface serial 0/1/0
HQ1(config-if)# id address 20.18.64.2 255.255.255.24
HQ1(config-if)# no shutdown
HQ1(config)# interface loopback 101
HQ1(config-if)# id address 11.11.11.11 255.255.255.255
HQ1(config-if)# ipv6 enable
HQ1(config-if)# ipv6 address dead:beef::1/128
HQ1(config-if)# no shutdown
```
7. Устройство должно быть доступно для управления по протоколу SSH версии 2.
```
HQ1(config)# crypto key generate rsa
HQ1(config)# ip ssh version 2
HQ1(config)# line vty 0 15
HQ1(config-line)# transport input ssh
```
8. Установите правильное локальное время
```
# clock set 13:32:00 23 December 2017
```
